*** 持続予測(ナイーブ予測)
:PROPERTIES:
:CUSTOM_ID: 持続予測ナイーブ予測
:END:
#+begin_src jupyter-python
# 最後の観測値をテストデータの件数だけ繰り返す
naive_pred = pd.DataFrame({'value':np.tile(train.loc['1957-12-01'], 
                                           len(test))}, 
                          index=test.index)
print(naive_pred.head(3))
#+end_src

#+RESULTS:
:             value
: 1958-01-01    336
: 1958-02-01    336
: 1958-03-01    336


